# StructuralSectionSigmaProfileWithLips Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionSigmaProfileWithLips Class
Members See Also
---
Defines parameters for structural Sigma Profile section with lips.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class StructuralSectionSigmaProfileWithLips : StructuralSectionColdFormed
```

Visual Basic
---
```text
Public Class StructuralSectionSigmaProfileWithLips _
	Inherits StructuralSectionColdFormed
```

Visual C++
---
```text
public ref class StructuralSectionSigmaProfileWithLips : public StructuralSectionColdFormed
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRectangular Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionColdFormed Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionSigmaProfileWithLips
# See Also
StructuralSectionSigmaProfileWithLips Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace